URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "JIA7oAxIxU6nohyjElEE_A"], ["LIMIT", 1]]
---
  def self.random_code
    code = SecureRandom.urlsafe_base64
    while self.exists?(:short_url => code)